Tekla.Structures.Model.BoltGroup.BoltHoleTypeEnum
The special hole type.

Tekla.Structures.Model.BoltGroup.BoltHoleTypeEnum.HOLE_TYPE_OVERSIZED
The oversized hole type.

Tekla.Structures.Model.BoltGroup.BoltHoleTypeEnum.HOLE_TYPE_SLOTTED
The slotted hole type.

Tekla.Structures.Model.BoltGroup.BoltHoleTypeEnum.HOLE_TYPE_NO_HOLE
The no hole type.

Tekla.Structures.Model.BoltGroup.BoltHoleTypeEnum.HOLE_TYPE_TAPPED
The tapped hole type.